Repository: P4suta/find-my-files
Catalog: app/FindMyFiles/Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, zh_hans

# Common_Retry
source: Retry
ja_jp: 再試行

# Search_Placeholder
source: Search by file name…
ja_jp: ファイル名で検索…
zh_hans: 按文件名搜索…

# Search_PlaceholderRegexName
source: Regex over file name…
ja_jp: ファイル名を正規表現で検索…
zh_hans: 用正则表达式匹配文件名…

# Search_PlaceholderRegexPath
source: Regex over full path…
ja_jp: フルパスを正規表現で検索…
zh_hans: 用正则表达式匹配完整路径…

# OptFocused.Header
source: Focused
ja_jp: 絞り込み
zh_hans: 精简

# OptFocused.Description
source: Common formats only; excludes system areas
ja_jp: よく使う形式に限定し、システム領域を除外
zh_hans: 仅常用格式，排除系统区域

# OptSystem.Header
source: Include system and hidden files
ja_jp: システム・隠しファイルを含める
zh_hans: 包含系统和隐藏文件

# OptRegex.Header
source: Regex mode
ja_jp: 正規表現モード
zh_hans: 正则表达式模式

# OptRegex.Description
source: Treat the whole query as one regular expression
ja_jp: クエリ全体を1つの正規表現として扱う
zh_hans: 将整个查询作为一个正则表达式

# OptCloseToTray.Header
source: Close to tray
ja_jp: トレイに常駐
zh_hans: 关闭到托盘

# OptCloseToTray.Description
source: Keeps running in the background instead of exiting
ja_jp: 閉じても終了せずバックグラウンドで動作し続ける
zh_hans: 关闭时不退出，继续在后台运行

# RegexScopeMenu.Header
source: Regex applies to
ja_jp: 正規表現の対象
zh_hans: 正则匹配范围

# RegexScopeName.Content
source: File name
ja_jp: ファイル名
zh_hans: 文件名

# RegexScopePath.Content
source: Full path
ja_jp: フルパス
zh_hans: 完整路径

# SortHeaderItem.Header
source: Sort by
ja_jp: 並べ替え
zh_hans: 排序方式

# SortName.Content
source: Name
ja_jp: 名前
zh_hans: 名称

# SortSize.Content
source: Size
ja_jp: サイズ
zh_hans: 大小

# SortDate.Content
source: Date modified
ja_jp: 更新日時
zh_hans: 修改日期

# StatusMenuItem.Text
source: Status
ja_jp: 状態
zh_hans: 状态

# About_AppVersion
source: App: v{0}
ja_jp: アプリ: v{0}
zh_hans: 应用: v{0}

# About_EngineVersion
source: Engine: v{0}
ja_jp: エンジン: v{0}
zh_hans: 引擎: v{0}

# AboutVersionMismatch.Title
source: Version mismatch
ja_jp: バージョン不一致
zh_hans: 版本不匹配

# AboutVersionMismatch.Message
source: The app and search service are from different releases. Repair the service to install the matching build.
ja_jp: アプリと検索サービスのリリースが異なります。サービスを修復して一致するビルドを登録してください。
zh_hans: 应用与引擎来自不同的构建。请重启应用，或更新以使两者一致。

# DiagCard.Header
source: Diagnostics
ja_jp: 診断
zh_hans: 显示/隐藏诊断信息

# DiagCard.Description
source: Inspect logs, engine status, and performance counters.
ja_jp: ログ、エンジンの状態、パフォーマンス指標を確認します。

# ServiceCard.Header
source: Manage service…
ja_jp: サービスの管理…
zh_hans: 管理服务…

# ServiceCard.Description
source: Repair, restart, or uninstall the search service.
ja_jp: 検索サービスの修復、再起動、アンインストールを行います。

# LangMenu.Header
source: Language
ja_jp: 言語
zh_hans: 语言

# LangSystem.Content
source: System default
ja_jp: システム既定
zh_hans: 系统默认

# MnuOpen.Text
source: Open
ja_jp: 開く
zh_hans: 打开

# MnuOpenPath.Text
source: Open folder and select file
ja_jp: フォルダーを開いてファイルを選択
zh_hans: 打开文件夹并选中文件

# MnuCopyPath.Text
source: Copy path
ja_jp: パスをコピー
zh_hans: 复制路径

# SetupTitle.Text
source: Get file search ready
ja_jp: ファイル検索を準備しましょう
zh_hans: 开始设置文件搜索

# SetupBody.Text
source: Find My Files uses a local Windows service to index NTFS drives. Enable it once with administrator permission. To repair an earlier setup, open Settings and repair.
ja_jp: NTFS ドライブを高速に索引するため、ローカルの Windows サービスを使います。初回だけ管理者の許可で有効にします。以前の設定を修復する場合は「設定と修復」を開いてください。
zh_hans: 索引整个驱动器最快、最全 — 只需一次性的管理员权限设置。

# EnableSearch.Content
source: Enable search
ja_jp: 検索を有効にする
zh_hans: 启用搜索

# SetupRecovery.Content
source: Settings and repair
ja_jp: 設定と修復

# SettingsDialogRoot.Title
source: Settings
ja_jp: 設定

# SettingsDialogRoot.CloseButtonText
source: Close
ja_jp: 閉じる

# SettingsGroup_Search.Text
source: Search
ja_jp: 検索
zh_hans: 搜索

# SettingsGroup_General.Text
source: General
ja_jp: 全般
zh_hans: 常规

# SettingsGroup_Advanced.Text
source: Advanced
ja_jp: 詳細
zh_hans: 高级

# SortDescendingCard.Header
source: Descending
ja_jp: 降順
zh_hans: 降序

# DiagOpen.Content
source: Open diagnostics
ja_jp: 診断を開く

# ServiceOpen.Content
source: Manage service
ja_jp: サービスを管理

# Status_ModePrivileged
source: Mode: fixed NTFS drives only
ja_jp: モード: 固定 NTFS ドライブのみ
zh_hans: 模式: 所有驱动器

# StatusVolumeScope.Text
source: ReFS, FAT/exFAT, removable media, and network drives are not indexed.
ja_jp: ReFS、FAT/exFAT、リムーバブル メディア、ネットワーク ドライブは索引しません。

# Settings_OpenFailed
source: Couldn't open settings
ja_jp: 設定を開けませんでした
zh_hans: 无法打开设置

# NoResultsTitle.Text
source: No results found
ja_jp: 結果が見つかりません
zh_hans: 未找到结果

# NoResults_Body
source: No results for “{0}”
ja_jp: 「{0}」に一致する結果はありません
zh_hans: 未找到与“{0}”匹配的结果

# SvcDialog.Title
source: Manage service
ja_jp: サービスの管理
zh_hans: 管理服务

# SvcDialog.CloseButtonText
source: Close
ja_jp: 閉じる
zh_hans: 关闭

# SvcSubtitle.Text
source: fmf-engine (file name search service)
ja_jp: fmf-engine(ファイル名検索サービス)
zh_hans: fmf-engine(文件名搜索服务)

# SvcGroupRunning.Text
source: Run
ja_jp: 稼働
zh_hans: 运行

# SvcGroupRegister.Text
source: Register
ja_jp: 登録
zh_hans: 注册

# SvcGroupDelete.Text
source: Remove
ja_jp: 削除
zh_hans: 删除

# SvcStart.Content
source: Start
ja_jp: 開始
zh_hans: 启动

# SvcStop.Content
source: Stop
ja_jp: 停止
zh_hans: 停止

# SvcRestart.Content
source: Restart
ja_jp: 再起動
zh_hans: 重启

# SvcRegister.Content
source: Register and start
ja_jp: 登録して開始
zh_hans: 注册并启动

# SvcReregister.Content
source: Re-register
ja_jp: 登録し直す
zh_hans: 重新注册

# SvcUninstall.Content
source: Remove service only
ja_jp: サービスだけを解除
zh_hans: 卸载

# SvcPurgeData.Content
source: Remove all Find My Files data…
ja_jp: Find My Files の全データを削除…
zh_hans: 同时删除索引和日志

# SvcPurgeConfirmTitle.Text
source: Remove all Find My Files data?
ja_jp: Find My Files の全データを削除しますか？

# SvcPurgeConfirmBody.Text
source: If installed, this removes the service and scheduled task. It permanently deletes all engine data in %ProgramData%\find-my-files and your UI settings and app logs in %APPDATA%\find-my-files. Find My Files will close.
ja_jp: サービスが登録済みなら、サービスとスケジュールタスクも解除します。%ProgramData%\find-my-files のすべてのエンジンデータと、%APPDATA%\find-my-files の UI 設定・アプリログを完全に削除します。Find My Files は終了します。

# SvcPurgeConfirm.Content
source: Remove all data
ja_jp: 全データを削除

# SvcPurgeCancel.Content
source: Cancel
ja_jp: キャンセル

# SvcRestartApp.Content
source: Restart app
ja_jp: アプリを再起動
zh_hans: 重启应用

# CopyDiag.Content
source: Copy diagnostics
ja_jp: 診断情報をコピー
zh_hans: 复制诊断信息

# DiagLastQueryHeader.Text
source: Last query
ja_jp: 直近クエリ
zh_hans: 最近的查询

# DiagStorageHeader.Text
source: Storage
ja_jp: ストレージ
zh_hans: 存储

# DiagTransportHeader.Text
source: Transport
ja_jp: トランスポート
zh_hans: 传输

# DiagHealthy.Text
source: No degradations
ja_jp: 劣化なし
zh_hans: 无降级

# DiagStatTime.Text
source: Time
ja_jp: 時間
zh_hans: 时间

# DiagStatHits.Text
source: Hits
ja_jp: ヒット
zh_hans: 命中

# DiagStatScanned.Text
source: Scanned
ja_jp: 走査
zh_hans: 扫描

# DiagStatDriver.Text
source: Driver
ja_jp: 方式
zh_hans: 方式

# DiagHealthHeaderBar.Title
source: Health
ja_jp: 健全性
zh_hans: 健康状况

# DiagMemoryHeader.Text
source: Memory
ja_jp: メモリ
zh_hans: 内存

# DiagMemProcess.Text
source: Process
ja_jp: プロセス
zh_hans: 进程

# DiagMemIndex.Text
source: Index
ja_jp: 索引
zh_hans: 索引

# DiagMemOverhead.Text
source: Overhead
ja_jp: その他
zh_hans: 其他

# DiagScanHeader.Text
source: Last scan
ja_jp: 直近のスキャン
zh_hans: 最近扫描

# DiagOpenEngineLog.Content
source: Engine log
ja_jp: エンジンログ
zh_hans: 引擎日志

# DiagOpenAppLog.Content
source: App log
ja_jp: アプリログ
zh_hans: 应用日志

# Tray_Open
source: Open
ja_jp: 開く
zh_hans: 打开

# Tray_Exit
source: Exit
ja_jp: 終了
zh_hans: 退出

# OptionsButton_ToolTip
source: Settings, status, diagnostics (focus / hidden files / sort / count / engine / diagnostics)
ja_jp: 設定・状態・診断(絞り込み/隠しファイル/並べ替え/件数/エンジン/診断)
zh_hans: 设置、状态、诊断(精简/隐藏文件/排序/数量/引擎/诊断)

# OptionsButton_Name
source: Settings, status, diagnostics
ja_jp: 設定・状態・診断
zh_hans: 设置、状态、诊断

# ResultsList_Name
source: Search results
ja_jp: 検索結果

# VersionMismatch_RepairAction
source: Repair service
ja_jp: サービスを修復

# DiagWindowTitle
source: Diagnostics
ja_jp: 診断
zh_hans: 诊断

# Status_Preparing
source: Preparing…
ja_jp: 準備中…
zh_hans: 正在准备…

# Status_CountWithTime
source: {0:F1} ms · {1:N0} items
ja_jp: {0:F1} ms · {1:N0} 件
zh_hans: {0:F1} ms · {1:N0} 项

# Status_Count
source: {0:N0} items
ja_jp: {0:N0} 件
zh_hans: {0:N0} 项

# Status_QueryErrorPrefix
source: Query error: {0}
ja_jp: クエリエラー: {0}
zh_hans: 查询错误：{0}

# Status_NoNtfsDrives
source: No fixed NTFS drives found
ja_jp: NTFS固定ドライブが見つかりません
zh_hans: 未找到 NTFS 固定驱动器

# Status_Indexing
source: Indexing: {0}
ja_jp: インデックス作成中: {0}
zh_hans: 正在建立索引：{0}

# Status_IndexFailed
source: Indexing failed: {0}
ja_jp: インデックスに失敗: {0}
zh_hans: 建立索引失败：{0}

# Status_Ready
source: Ready — {0:N0} items
ja_jp: 準備完了 — {0:N0} 件
zh_hans: 就绪 — {0:N0} 项

# Status_ServiceUnregistered
source: Search service is not registered
ja_jp: 検索サービスが未登録です
zh_hans: 搜索服务尚未注册

# Status_IndexStartFailed
source: Failed to start indexing
ja_jp: インデックス開始に失敗しました
zh_hans: 启动索引失败

# Volume_Indexing
source: {0} indexing… {1:N0} items
ja_jp: {0} をインデックス中… {1:N0} 件
zh_hans: {0} 正在建立索引… {1:N0} 项

# Volume_Ready
source: {0} ready — {1:N0} items
ja_jp: {0} 準備完了 — {1:N0} 件
zh_hans: {0} 就绪 — {1:N0} 项

# Volume_Rescanning
source: {0} rescanning…
ja_jp: {0} を再スキャン中…
zh_hans: {0} 正在重新扫描…

# Volume_Failed
source: {0} indexing failed
ja_jp: {0} のインデックスに失敗
zh_hans: {0} 建立索引失败

# EngineMode_Disconnected
source: disconnected
ja_jp: 未接続
zh_hans: 未连接

# EngineMode_Fake
source: demo
ja_jp: デモ
zh_hans: 演示

# EngineMode_Admin
source: administrator (in-proc)
ja_jp: 管理者(in-proc)
zh_hans: 管理员(进程内)

# EngineMode_Connected
source: service connected
ja_jp: サービス接続
zh_hans: 已连接服务

# EngineMode_Reconnecting
source: reconnecting…
ja_jp: 再接続中…
zh_hans: 正在重新连接…

# EngineMode_Connecting
source: connecting…
ja_jp: 接続中…
zh_hans: 正在连接…

# Notify_ReconnectingTitle
source: Reconnecting to the engine service…
ja_jp: エンジンサービスに再接続しています…
zh_hans: 正在重新连接到引擎服务…

# Notify_ReconnectingBody
source: Results refresh automatically once the connection recovers
ja_jp: 接続が回復すると結果は自動的に更新されます
zh_hans: 连接恢复后结果会自动更新

# Notify_IndexStartFailedTitle
source: Couldn't start indexing
ja_jp: インデックスを開始できませんでした
zh_hans: 无法启动索引

# Notify_VolumeIndexFailedTitle
source: Failed to index {0}
ja_jp: {0} のインデックスに失敗しました
zh_hans: 无法为 {0} 建立索引

# Notify_VolumeIndexFailedBody
source: See Settings → Diagnostics or the engine logs folder for details
ja_jp: 詳細は 設定→診断 パネルまたはエンジンログフォルダーを参照
zh_hans: 详情请见 设置→诊断 面板或 engine.log

# Notify_SearchFailedTitle
source: Search failed
ja_jp: 検索に失敗しました
zh_hans: 搜索失败

# Notify_SearchUnexpectedTitle
source: An unexpected error occurred during search
ja_jp: 検索中に予期しないエラーが発生しました
zh_hans: 搜索时发生意外错误

# Notify_EnginePanicTitle
source: The engine panicked internally
ja_jp: エンジン内部でパニックが発生しました
zh_hans: 引擎内部发生严重错误

# Notify_EngineErrorTitle
source: An engine error occurred
ja_jp: エンジンでエラーが発生しました
zh_hans: 引擎发生错误

# Setup_WaitingForPermission
source: Waiting for administrator permission…
ja_jp: 管理者の許可を待っています…
zh_hans: 正在等待管理员授权…

# Setup_Connecting
source: Connecting to the service…
ja_jp: サービスに接続しています…
zh_hans: 正在连接服务…

# Setup_Failed
source: Setup failed. Try again, or open Settings and repair for diagnostics and service recovery.
ja_jp: セットアップに失敗しました。再試行するか、「設定と修復」で診断とサービスの修復を行えます。
zh_hans: 设置失败，请重试。

# Setup_PortableLocation
source: Everything is kept in {0} — nothing is written outside this folder.
ja_jp: 設定とインデックスは {0} に保存され、このフォルダの外には何も書き込みません。
zh_hans: 所有内容都保存在 {0}，不会在此文件夹之外写入任何内容。

# Svc_StateChecking
source: Checking…
ja_jp: 確認中…
zh_hans: 正在检查…

# Svc_ExeNotFound
source: fmf-service.exe not found
ja_jp: fmf-service.exe が見つかりません
zh_hans: 未找到 fmf-service.exe

# Svc_StateUnregistered
source: Not registered
ja_jp: 未登録
zh_hans: 未注册

# Svc_StateStopped
source: Stopped
ja_jp: 停止中
zh_hans: 已停止

# Svc_StateRunningPid
source: Running (PID {0})
ja_jp: 実行中 (PID {0})
zh_hans: 运行中 (PID {0})

# Svc_StateRunning
source: Running
ja_jp: 実行中
zh_hans: 运行中

# Svc_StateUnavailable
source: Service status unavailable
ja_jp: サービス状態を確認できません

# Svc_Started
source: Service started
ja_jp: サービスを開始しました
zh_hans: 服务已启动

# Svc_Stopped
source: Service stopped
ja_jp: サービスを停止しました
zh_hans: 服务已停止

# Svc_Restarted
source: Service restarted
ja_jp: サービスを再起動しました
zh_hans: 服务已重启

# Svc_Registered
source: Service registered
ja_jp: サービスを登録しました
zh_hans: 服务已注册

# Svc_Uninstalled
source: Service removed
ja_jp: サービスを解除しました
zh_hans: 服务已卸载

# Svc_UninstalledWithData
source: Service and all FindMyFiles data removed
ja_jp: サービスと FindMyFiles の全データを削除しました

# Svc_UserDataPurgeFailed
source: The service and engine data were removed, but your UI settings or app logs could not be deleted. Close anything using those files, then choose “Remove all Find My Files data” again.
ja_jp: サービスとエンジンデータは削除しましたが、UI 設定またはアプリログを削除できませんでした。使用中のファイルを閉じてから、もう一度「Find My Files の全データを削除」を選んでください。

# Settings_SaveFailedTitle
source: Settings weren't saved
ja_jp: 設定を保存できませんでした

# Settings_SaveFailedBody
source: The change was reverted. Check access to %APPDATA%\find-my-files and try again.
ja_jp: 変更を元に戻しました。%APPDATA%\find-my-files へのアクセスを確認して、もう一度お試しください。

# Settings_LanguageSaveFailedBody
source: The language was not changed because settings.json could not be saved.
ja_jp: settings.json を保存できなかったため、言語は変更されませんでした。

# Diag_Copied
source: Diagnostics copied to the clipboard
ja_jp: 診断情報をクリップボードにコピーしました

# Svc_Cancelled
source: Cancelled at the UAC prompt
ja_jp: UAC で取り消されました
zh_hans: 已在 UAC 提示处取消

# Svc_Failed
source: Failed (exit code {0}). Try again. If it keeps failing, open Settings and repair → Diagnostics.
ja_jp: 失敗しました(終了コード {0})。もう一度お試しください。繰り返す場合は「設定と修復」→「診断」を開いてください。
zh_hans: 失败(退出代码 {0})。在管理员终端运行 `fmf-service {1}` 可查看原因

# Svc_IdentityUnavailable
source: Windows could not identify your account, so setup was stopped before requesting administrator access. Sign out and back in, then try again.
ja_jp: Windows でユーザーを特定できなかったため、管理者権限を要求する前にセットアップを中止しました。サインアウトしてから再度サインインし、もう一度お試しください。

# Svc_RegisteredNotConfirmed
source: Registered, but the connection isn't confirmed yet. Press “Restart app” or try again shortly.
ja_jp: 登録しましたが、まだ接続を確認できません。「アプリを再起動」を押すか、しばらくして再度お試しください。
zh_hans: 已注册，但尚未确认连接。请按“重启应用”，或稍后重试。

# Svc_Incompatible
source: This installed service is from a different version. Re-register it to update the engine.
ja_jp: インストール済みサービスの版が異なります。再登録してエンジンを更新してください。

# Svc_ControlFailed
source: The service action failed. Re-register the service to repair its permissions or version.
ja_jp: サービス操作に失敗しました。再登録して権限または版を修復してください。

# Svc_OpenFailed
source: Couldn't open service management
ja_jp: サービス管理を開けませんでした
zh_hans: 无法打开服务管理

# Shell_OpenFailed
source: Couldn't open
ja_jp: 開けませんでした
zh_hans: 无法打开

# Shell_RevealFailed
source: Couldn't open the folder
ja_jp: フォルダーを開けませんでした
zh_hans: 无法打开文件夹

# Shell_RelaunchFailed
source: Couldn't restart
ja_jp: 再起動できませんでした
zh_hans: 无法重启

# Shell_ClipboardFailed
source: Couldn't copy to the clipboard
ja_jp: クリップボードへのコピーに失敗しました
zh_hans: 复制到剪贴板失败

# Shell_UnsafeIndexedName
source: This name has no unambiguous Windows path spelling
ja_jp: この名前は Windows のパスとして一意に解釈できません

# Shell_ReparsePointBlocked
source: Shell actions are disabled for paths that redirect through a junction or symbolic link
ja_jp: ジャンクションやシンボリックリンクで別の場所を指すパスではシェル操作を無効にしています

# Shell_IdentityChanged
source: This path no longer points to the indexed file
ja_jp: このパスは索引済みのファイルを指していません

# Shell_HintMoved
source: The file may have been moved or deleted
ja_jp: ファイルが移動・削除された可能性があります
zh_hans: 文件可能已被移动或删除

# Shell_HintAccessDenied
source: Access denied — check permissions
ja_jp: アクセスが拒否されました — 権限を確認してください
zh_hans: 访问被拒绝 — 请检查权限

# Shell_HintCancelled
source: The operation was cancelled in UAC
ja_jp: UAC で操作が取り消されました
zh_hans: 操作已在 UAC 中取消

# Shell_HintMovedRecently
source: The file may have just been moved or deleted
ja_jp: ファイルが移動・削除された直後の可能性があります
zh_hans: 文件可能刚刚被移动或删除

# Shell_HintPathTooLong
source: The path is too long — turn on long paths in Windows settings
ja_jp: パスが長すぎます — Windows の設定で長いパスを有効にしてください

# App_LockedTitle
source: Can't use the in-proc engine while the service is running
ja_jp: 検索サービスが稼働中のため in-proc エンジンを使えません
zh_hans: 搜索服务正在运行，无法使用进程内引擎

# App_LockedBody
source: You can connect to the service with a normal launch. To use in-proc, stop the service first (`just service-stop`).
ja_jp: 通常起動でサービスに接続できます。in-proc を使う場合は先にサービスを停止してください(`just service-stop`)。
zh_hans: 正常启动即可连接服务。若要使用进程内引擎，请先停止服务(`just service-stop`)。

# App_EngineInitFailedTitle
source: Search engine unavailable
ja_jp: 検索エンジンを利用できません
zh_hans: 搜索引擎初始化失败(正在以回退模式运行)

# App_EngineInitFailedBody
source: {0} The fmf-service may not be running, or another engine may be holding the index (see the engine logs folder).
ja_jp: {0} fmf-service が未起動か、インデックスを他のエンジンがロックしている可能性があります(詳細はエンジンログフォルダー)。
zh_hans: {0} fmf-service 可能未运行，或索引被其他引擎锁定(详见 engine.log)。

# Crash_UnexpectedTitle
source: An unexpected error occurred
ja_jp: 予期しないエラーが発生しました
zh_hans: 发生意外错误

# Crash_BackgroundTitle
source: A background task failed
ja_jp: バックグラウンド処理でエラーが発生しました
zh_hans: 后台任务失败

# Crash_PreviousTitle
source: The app closed unexpectedly last time
ja_jp: 前回、アプリが異常終了しました
zh_hans: 应用上次异常退出

# Crash_PreviousBody
source: Details: {0} {1}
ja_jp: 詳細: {0} {1}
zh_hans: 详情：{0} {1}

# Crash_InternalArea
source: An internal error occurred ({0})
ja_jp: 内部エラーが発生しました({0})
zh_hans: 发生内部错误({0})

# Drag_AddAsCondition
source: Add as a search filter
ja_jp: 検索条件として追加
zh_hans: 添加为搜索条件

# Virtualization_PageFetchFailed
source: Couldn't load results
ja_jp: 結果の読み込みでエラーが発生しました

# Err_QuerySyntax
source: Query syntax error
ja_jp: クエリの構文エラー
zh_hans: 查询语法错误

# Err_Stale
source: Results changed; retrying
ja_jp: 結果が更新されました。再試行します
zh_hans: 结果已更新，正在重试

# Err_NotAdmin
source: Administrator rights required
ja_jp: 管理者権限が必要です
zh_hans: 需要管理员权限

# Err_Locked
source: The index is locked by another engine
ja_jp: インデックスを他のエンジンがロックしています
zh_hans: 索引被其他引擎锁定

# Err_Io
source: I/O error
ja_jp: 入出力エラー
zh_hans: 输入/输出错误

# Err_Panic
source: The engine panicked
ja_jp: エンジンでパニックが発生しました
zh_hans: 引擎发生严重错误

# Err_Volume
source: Volume error
ja_jp: ボリュームエラー
zh_hans: 卷错误

# Err_Generic
source: Engine error
ja_jp: エンジンエラー
zh_hans: 引擎错误
